In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [4]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
df1 = pd.DataFrame()

In [7]:
df.fillna(0, inplace = True)

In [8]:
FlightNumber = df['FlightNumber']
FlightNumber = list(map(int, FlightNumber))

In [9]:
for i in range(len(FlightNumber)):
    if FlightNumber[i] ==0:
        FlightNumber[i] = (FlightNumber[i-1]+10)

In [12]:
df1['FlightNumber'] = FlightNumber

In [13]:
df1

   FlightNumber
0         10045
1         10055
2         10065
3         10075
4         10085

In [15]:
from_to = [i.split('_') for i in df['From_To']]
from_to

[['LoNDon', 'paris'],
 ['MAdrid', 'miLAN'],
 ['londON', 'StockhOlm'],
 ['Budapest', 'PaRis'],
 ['Brussels', 'londOn']]

In [16]:
From = [i[0].title() for i in from_to]
To = [i[1].title() for i in from_to]

In [18]:
From

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [19]:
df1['From'] = From
df1['To'] = To

In [20]:
df1

   FlightNumber      From         To
0         10045    London      Paris
1         10055    Madrid      Milan
2         10065    London  Stockholm
3         10075  Budapest      Paris
4         10085  Brussels     London

In [31]:
delay_len = [len(i) for i in df['RecentDelays']]
max_del = max(delay_len)
RecentDelays = []
for each in df['RecentDelays']:
    k = max_del-len(each)
    for i in range(k):
        each.append(np.NaN)
    RecentDelays.append(each)
RecentDelays

[[23, 47, nan], [nan, nan, nan], [24, 43, 87], [13, nan, nan], [67, 32, nan]]

In [38]:
df2 = pd.DataFrame(RecentDelays, columns = ['delay_1', 'delay_2', 'delay_3'])
df2

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [50]:
df3 = pd.concat([df1,df2], axis = 1)
df3

   FlightNumber      From         To  delay_1  delay_2  delay_3
0         10045    London      Paris     23.0     47.0      NaN
1         10055    Madrid      Milan      NaN      NaN      NaN
2         10065    London  Stockholm     24.0     43.0     87.0
3         10075  Budapest      Paris     13.0      NaN      NaN
4         10085  Brussels     London     67.0     32.0      NaN

In [58]:
df.drop(['From_To', 'FlightNumber', 'RecentDelays'], axis = 1, inplace = True)

In [62]:
final_df = pd.concat([df3, df], axis = 1)

In [63]:
final_df

,FlightNumber,From,To,delay_1,delay_2,delay_3,Airline
0,10045,London,Paris,23.0,47.0,NaN,KLM(!)
1,10055,Madrid,Milan,NaN,NaN,NaN,<Air France> (12)
2,10065,London,Stockholm,24.0,43.0,87.0,(British Airways. )
3,10075,Budapest,Paris,13.0,NaN,NaN,12. Air France
4,10085,Brussels,London,67.0,32.0,NaN,"""Swiss Air"""